Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПодтверждениеОперацийБэкОфиса</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодтверждаемыеОперацииБэкОфиса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПереводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаПереводДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаПереводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПеревода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПереводаДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредствПолучатель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БрокерПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыпискиПолучатель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса/Ext/ManagerModule.bsl
Функция ПолучитьДоступныеОснования() Экспорт
	ДоступныеОснования = Новый Массив;

	ДоступныеОснования.Добавить("Банковские выписки");
	ДоступныеОснования.Добавить("Выставленный счет");
	ДоступныеОснования.Добавить("Договор");
	ДоступныеОснования.Добавить("Клиринговый отчет");
	ДоступныеОснования.Добавить("Подтверждение МНО");
	ДоступныеОснования.Добавить("Приходный кассовый ордер");
	ДоступныеОснования.Добавить("Проспект эмиссии");
	ДоступныеОснования.Добавить("Расчет вознаграждения");
	ДоступныеОснования.Добавить("Расчет НДФЛ");
	ДоступныеОснования.Добавить("Решение общего собрания");
	ДоступныеОснования.Добавить("Решение о выпуске");
	ДоступныеОснования.Добавить("Решение эмитента");
	ДоступныеОснования.Добавить("Оригинал документа");
	ДоступныеОснования.Добавить("Отчет брокера");
	ДоступныеОснования.Добавить("Отчет депозитария");
	
	Возврат ДоступныеОснования; 
КонецФункции

Функция ПолучитьПодтверждаемыеВидыОпераций() Экспорт
	ПодтверждаемыеВидыОпераций = Новый Массив;
	
	Для Каждого ТипОперации Из Метаданные.ОпределяемыеТипы.ПодтверждаемыеОперацииБэкОфиса.Тип.Типы() Цикл
		ИмяТипа = Метаданные.НайтиПоТипу(ТипОперации).Имя;
		Если ИмяТипа <> "РегистрацияСтоимостиАктивов" Тогда
			ПодтверждаемыеВидыОпераций.Добавить(Перечисления.ВидыОперацийБэкОфиса[ИмяТипа]);		
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ПодтверждаемыеВидыОпераций;	
КонецФункции

#Область Сведения_о_подтверждении_операций

Функция ОперацияПодтверждена(Операция, СведенияОПодтверждении = Неопределено) Экспорт
	
	СведенияОПодтверждении = ПолучитьПоследнююЗаписьЖурналаПодтверждений(Операция);
	
	Возврат ?(СведенияОПодтверждении = Неопределено, Ложь, СведенияОПодтверждении.Подтверждена);
КонецФункции

Функция ПолучитьПоследнююЗаписьЖурналаПодтверждений(Операция) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодтверждениеОперацийБэкОфиса.Период КАК Период,
		|	ПодтверждениеОперацийБэкОфиса.Организация КАК Организация,
		|	ПодтверждениеОперацийБэкОфиса.Операция КАК Операция,
		|	ПодтверждениеОперацийБэкОфиса.Подтверждена КАК Подтверждена,
		|	ПодтверждениеОперацийБэкОфиса.Основание КАК Основание,
		|	ПодтверждениеОперацийБэкОфиса.Ответственный КАК Ответственный,
		|	ПодтверждениеОперацийБэкОфиса.РучнойРежим КАК РучнойРежим,
		|	ПодтверждениеОперацийБэкОфиса.Примечание КАК Примечание
		|ИЗ
		|	РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(, Операция = &Операция) КАК ПодтверждениеОперацийБэкОфиса");
	Запрос.УстановитьПараметр("Операция", Операция);
	
	УстановитьПривилегированныйРежим(Истина);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписьЖурналаПодтверждений = РезультатЗапроса.Выгрузить()[0];
	
	СведенияОПодтверждении = Новый Структура("Период, Организация, Операция, Подтверждена, Основание, Ответственный, РучнойРежим, Примечание");
	ЗаполнитьЗначенияСвойств(СведенияОПодтверждении, ЗаписьЖурналаПодтверждений);
	
	Возврат СведенияОПодтверждении;	
	
КонецФункции

Функция ПолучитьПервуюЗаписьЖурналаПодтверждений(Операция) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодтверждениеОперацийБэкОфиса.Период КАК Период,
		|	ПодтверждениеОперацийБэкОфиса.Организация КАК Организация,
		|	ПодтверждениеОперацийБэкОфиса.Операция КАК Операция,
		|	ПодтверждениеОперацийБэкОфиса.Подтверждена КАК Подтверждена,
		|	ПодтверждениеОперацийБэкОфиса.Основание КАК Основание,
		|	ПодтверждениеОперацийБэкОфиса.Ответственный КАК Ответственный,
		|	ПодтверждениеОперацийБэкОфиса.РучнойРежим КАК РучнойРежим,
		|	ПодтверждениеОперацийБэкОфиса.Примечание КАК Примечание
		|ИЗ
		|	РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПервых(, Операция = &Операция) КАК ПодтверждениеОперацийБэкОфиса");
	Запрос.УстановитьПараметр("Операция", Операция);
	
	УстановитьПривилегированныйРежим(Истина);	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписьЖурналаПодтверждений = РезультатЗапроса.Выгрузить()[0];
	
	СведенияОПодтверждении = Новый Структура("Период, Организация, Операция, Подтверждена, Основание, Ответственный, РучнойРежим, Примечание");
	ЗаполнитьЗначенияСвойств(СведенияОПодтверждении, ЗаписьЖурналаПодтверждений);
	
	Возврат СведенияОПодтверждении;	
	
КонецФункции

Функция ИсключитьПодтвержденныеОперации(Операции) Экспорт
	ПроверяемыеОперации = Новый ТаблицаЗначений;
	ПроверяемыеОперации.Колонки.Добавить("Операция", Метаданные.ОпределяемыеТипы.ПодтверждаемыеОперацииБэкОфиса.Тип);

	Для н = 1 По Операции.Количество() Цикл
		ПроверяемыеОперации.Добавить();
	КонецЦикла; 
	ПроверяемыеОперации.ЗагрузитьКолонку(Операции, "Операция");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроверяемыеОперации.Операция КАК Операция
		|ПОМЕСТИТЬ _ПроверяемыеОперации
		|ИЗ
		|	&ПроверяемыеОперации КАК _ПроверяемыеОперации
		|ГДЕ
		|	_ПроверяемыеОперации.Операция <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПроверяемыеОперации.Операция КАК Операция
		|ИЗ
		|	_ПроверяемыеОперации КАК _ПроверяемыеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(
		|				,
		|				(Операция, ИСТИНА) В
		|					(ВЫБРАТЬ
		|						_ПроверяемыеОперации.Операция,
		|						ИСТИНА
		|					ИЗ
		|						_ПроверяемыеОперации)) КАК ПодтверждениеОперацийБэкОфиса
		|		ПО (ПодтверждениеОперацийБэкОфиса.Операция = _ПроверяемыеОперации.Операция)
		|			И (ПодтверждениеОперацийБэкОфиса.Подтверждена = ИСТИНА)
		|ГДЕ
		|	ПодтверждениеОперацийБэкОфиса.Операция ЕСТЬ NULL");
	Запрос.УстановитьПараметр("ПроверяемыеОперации", ПроверяемыеОперации);
		
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Возвращает операции со временем внесения более поздним, чем указанная дата
//
// Параметры:
//	Операции	- ТаблицаЗначений	- таблица операций с колонками "Организация", "Операция"
//	Период		- Дата				- дата, позднее которой должна быть внесена операция 
//
// Возвращаемое значение:
//	- ТаблицаЗначений	- таблица операций с колонками "Операция", "ВремяВнесения"
//	- Неопределено		- если таких операций нет
//
Функция ОперацииВнесенныеПозднее(Операции, Период) Экспорт
	
	Если Операции.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	
	СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(Операции, "_Операции", Запрос, , "Организация, Операция", , "Организация, Операция");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Операции.Операция КАК Операция,
		|	ВнесениеОпераций.Период КАК ВремяВнесения
		|ИЗ
		|	_Операции КАК _Операции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса КАК ВнесениеОпераций
		|		ПО (ВнесениеОпераций.Организация = _Операции.Организация)
		|			И (ВнесениеОпераций.Операция = _Операции.Операция)
		|			И ((ВЫРАЗИТЬ(ВнесениеОпераций.Примечание КАК СТРОКА(15))) = ""Внесение записи"")
		|			И (ВнесениеОпераций.Период >= &Период)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Неопределено, РезультатЗапроса.Выгрузить());
	
КонецФункции

#КонецОбласти

#Область Подтверждение_и_отмена_подтверждения_операций

Функция ПодтвердитьОперации(Операции, Основание, ДатаПодтверждения, Примечание, РучнойРежим = Истина) Экспорт
	НеподтвержденныеОперации = ИсключитьПодтвержденныеОперации(Операции);
	Если НеподтвержденныеОперации.Количество() = 0 Тогда
		Возврат НеподтвержденныеОперации;
	КонецЕсли;
	
	Для Каждого МетаРесурс Из Метаданные.РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СтандартныеРеквизиты Цикл
		НеподтвержденныеОперации.Колонки.Добавить(МетаРесурс.Имя, МетаРесурс.Тип); 	
	КонецЦикла;	
	Для Каждого МетаРесурс Из Метаданные.РегистрыСведений.ПодтверждениеОперацийБэкОфиса.Ресурсы Цикл
		НеподтвержденныеОперации.Колонки.Добавить(МетаРесурс.Имя, МетаРесурс.Тип); 	
	КонецЦикла;
	
	НеподтвержденныеОперации.ЗаполнитьЗначения(ДатаПодтверждения, "Период");	
	НеподтвержденныеОперации.ЗаполнитьЗначения(Истина, "Подтверждена");	
	НеподтвержденныеОперации.ЗаполнитьЗначения(Основание, "Основание");
	НеподтвержденныеОперации.ЗаполнитьЗначения(Примечание, "Примечание");
	НеподтвержденныеОперации.ЗаполнитьЗначения(РучнойРежим, "РучнойРежим");
	
	ПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьНаборЗаписей();
	ПодтверждениеОперацийБэкОфиса.Загрузить(НеподтвержденныеОперации);
	ПодтверждениеОперацийБэкОфиса.Записать(Ложь);
	
	Возврат НеподтвержденныеОперации; 
КонецФункции

Процедура ОтменитьПодтверждениеОперации(Операция, Основание = Неопределено, Примечание = Неопределено, РучнойРежим = Истина, ВремяЗаписи = Неопределено) Экспорт
	
	ЭтоСсылкаНаОперацию		= СтрНачинаетсяС(XMLТипЗнч(Операция).ИмяТипа, "DocumentRef");
	ОперацияСсылка			= ?(ЭтоСсылкаНаОперацию, Операция, Операция.Ссылка);
	СведенияОПодтверждении	= Неопределено;
	
	Если ОперацияПодтверждена(ОперацияСсылка, СведенияОПодтверждении) Тогда		
		УстановитьПривилегированныйРежим(Истина);	
		
		ОтменаПодтверждения = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(ОтменаПодтверждения, СведенияОПодтверждении);
		
		ОтменаПодтверждения.Период			= ?(ВремяЗаписи = Неопределено, Макс(ТекущаяДата(), СведенияОПодтверждении.Период + 1), ВремяЗаписи);
		ОтменаПодтверждения.Подтверждена	= Ложь;	
		ОтменаПодтверждения.Основание		= ?(Основание = Неопределено, СведенияОПодтверждении.Основание, Основание);
		ОтменаПодтверждения.Примечание		= Примечание;
		ОтменаПодтверждения.РучнойРежим		= РучнойРежим;	
		
		ОтменаПодтверждения.Записать(Истина);
		
		УстановитьПривилегированныйРежим(Ложь);	
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьЗаписьВЖурналПодтверждений(Операция, Подтверждена = Истина, Основание, Примечание, РучнойРежим = Истина, ВремяЗаписи = Неопределено) Экспорт
	ЭтоСсылкаНаОперацию = СтрНачинаетсяС(XMLТипЗнч(Операция).ИмяТипа, "DocumentRef");
	
	Если ВремяЗаписи = Неопределено Тогда
		ВремяЗаписи = ТекущаяДата();
	КонецЕсли;
	
	ПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьМенеджерЗаписи();
	ПодтверждениеОперацийБэкОфиса.Период						= ВремяЗаписи;
	ПодтверждениеОперацийБэкОфиса.Операция						= ?(ЭтоСсылкаНаОперацию, Операция, Операция.Ссылка);
	ПодтверждениеОперацийБэкОфиса.Организация					= ?(ЭтоСсылкаНаОперацию, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "Организация"), Операция.Организация);
	ПодтверждениеОперацийБэкОфиса.Подтверждена					= Подтверждена;
	ПодтверждениеОперацийБэкОфиса.Основание						= Основание;
	ПодтверждениеОперацийБэкОфиса.Примечание					= Примечание;
	ПодтверждениеОперацийБэкОфиса.РучнойРежим					= РучнойРежим;	
	ПодтверждениеОперацийБэкОфиса.Записать(Истина);
	
	СведенияОПодтверждении = Новый Структура("Основание, Ответственный, РучнойРежим, Примечание, Период");
	ЗаполнитьЗначенияСвойств(СведенияОПодтверждении, ПодтверждениеОперацийБэкОфиса);
	
	Возврат СведенияОПодтверждении; 
КонецФункции

#Область Операции_с_брокером

Функция СформироватьСтруктуруОтбораОперацийСБрокером(Организация, СчетДоверительногоУправления = Неопределено, Брокер, НачалоПериода, КонецПериода) Экспорт
	
	ОтборОперацийСБрокером = Новый Структура;
	ОтборОперацийСБрокером.Вставить("Организация",					Организация);
	ОтборОперацийСБрокером.Вставить("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	ОтборОперацийСБрокером.Вставить("Брокер",						Брокер);
	ОтборОперацийСБрокером.Вставить("НачалоПериода",				НачалоПериода);
	ОтборОперацийСБрокером.Вставить("КонецПериода",					КонецПериода);
	
	Возврат ОтборОперацийСБрокером;
	
КонецФункции

// Подтверждает операции с брокером
//
// Параметры:
//	СведенияОбОперациях	- ТаблицаЗначений		- таблица неподтвержденных операций (состав колонок см. в ПолучитьНеподтвержденныеОперацииСБрокером)
//						- Структура				- параметры получения неподтвержденных операций (см. СформироватьСтруктуруОтбораОперацийСБрокером)
//	ВремяПодтверждения	- Дата, Неопределено	- время подтверждения. Если не указано, то используется текущее время
//	ВремяВнесения		- Дата, Неопределено	- время внесения. Если не указано, то запись о внесении не добавляется 
//
// Возвращаемое значение:
//	ПодтвержденныеОперации - ТаблицаЗначений - колонки соответствуют колонкам регистра ПодтверждениеОперацийБэкОфиса + колонка ПредставлениеОперации  
//
Функция ПодтвердитьОперацииСБрокером(СведенияОбОперациях, ВремяПодтверждения = Неопределено, ВремяВнесения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	Если ТипЗнч(СведенияОбОперациях) = Тип("Структура") Тогда
		
		Если ТипЗнч(СведенияОбОперациях.Брокер) <> Тип("СправочникСсылка.БрокерскиеКомпании") ИЛИ Не ЗначениеЗаполнено(СведенияОбОперациях.Брокер) Тогда
			ВызватьИсключение "Передано некорректное значение параметра 'Брокер'";	
		КонецЕсли;
		
		НеподтвержденныеОперации = ПолучитьНеподтвержденныеОперацииСБрокером(СведенияОбОперациях.Организация, СведенияОбОперациях.СчетДоверительногоУправления, СведенияОбОперациях.Брокер, СведенияОбОперациях.НачалоПериода, СведенияОбОперациях.КонецПериода);
		
	Иначе
		
		НеподтвержденныеОперации = СведенияОбОперациях;
		
	КонецЕсли;
		
	НеподтвержденныеОперации.Колонки.Добавить("Основание",		Метаданные.РегистрыСведений.ПодтверждениеОперацийБэкОфиса.Ресурсы.Основание.Тип);
	НеподтвержденныеОперации.Колонки.Добавить("Подтверждена",	Метаданные.РегистрыСведений.ПодтверждениеОперацийБэкОфиса.Ресурсы.Подтверждена.Тип);
	НеподтвержденныеОперации.Колонки.Добавить("Период",			Метаданные.РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СтандартныеРеквизиты.Период.Тип);
	
	// Установим время внесения, если оно передано
	
	Если ЗначениеЗаполнено(ВремяВнесения) Тогда
		
		НачатьТранзакцию();	
		
		ВремяВнесенияОпераций = НеподтвержденныеОперации.Скопировать();
		ВремяВнесенияОпераций.ЗаполнитьЗначения("Отчет брокера",	"Основание");  		
		ВремяВнесенияОпераций.ЗаполнитьЗначения(ВремяВнесения,		"Период");
		ВремяВнесенияОпераций.ЗаполнитьЗначения("Внесение записи",	"Примечание");

		Для Каждого Запись Из ВремяВнесенияОпераций Цикл
			
			// Время внесения можно корректировать только у определенных операций
			
			Если ТипЗнч(Запись.Операция) = Тип("ДокументСсылка.Маржа")
				ИЛИ ТипЗнч(Запись.Операция) = Тип("ДокументСсылка.НачислениеЗадолженности")
				ИЛИ ТипЗнч(Запись.Операция) = Тип("ДокументСсылка.Оплата")
			Тогда
			
			    Если ТипЗнч(Запись.Операция) = Тип("ДокументСсылка.НачислениеЗадолженности")
					ИЛИ ТипЗнч(Запись.Операция) = Тип("ДокументСсылка.Оплата")
				Тогда
					ВидЗадолженности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Операция, "ВидЗадолженности");
					Если ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии
						И ВидЗадолженности <> Справочники.ВидыЗадолженности.ПоТорговойКомиссии
					Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			
				ПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьНаборЗаписей();
				
				ПодтверждениеОперацийБэкОфиса.Отбор.Организация.Установить(Запись.Организация);
				ПодтверждениеОперацийБэкОфиса.Отбор.Операция.Установить(Запись.Операция);
				
				ЗаполнитьЗначенияСвойств(ПодтверждениеОперацийБэкОфиса.Добавить(), Запись);
				
				ПодтверждениеОперацийБэкОфиса.Записать(Истина);
			
			КонецЕсли;
			
		КонецЦикла;

		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	// Установим время подтверждения 
	
	ВремяПодтвержденияОпераций = ?(ЗначениеЗаполнено(ВремяПодтверждения), ВремяПодтверждения, ТекущаяДата());
	
	НеподтвержденныеОперации.ЗаполнитьЗначения("Отчет брокера",				"Основание");  		
	НеподтвержденныеОперации.ЗаполнитьЗначения(Истина,						"Подтверждена");  		
	НеподтвержденныеОперации.ЗаполнитьЗначения(ВремяПодтвержденияОпераций,	"Период");  		
	
	ПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьНаборЗаписей();
	ПодтверждениеОперацийБэкОфиса.Загрузить(НеподтвержденныеОперации);
	ПодтверждениеОперацийБэкОфиса.Записать(Ложь);	
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат НеподтвержденныеОперации;

КонецФункции

Функция ПолучитьНеподтвержденныеОперацииСБрокером(Организация, СчетДоверительногоУправления = Неопределено, Брокер, Знач НачалоПериода, Знач КонецПериода, ДляПодтвержденияОтчетомБрокера = Истина) Экспорт
	
	Если ТипЗнч(Брокер) <> Тип("СправочникСсылка.БрокерскиеКомпании") ИЛИ Не ЗначениеЗаполнено(Брокер) Тогда
		ВызватьИсключение "Передано некорректное значение параметра 'Брокер'";	
	КонецЕсли;
	
	// Подтверждаем операции только после 01.10.2017
	НачалоПериода	= Макс('20171001', НачалоПериода);
	КонецПериода	= Макс('20171001', КонецПериода);
	
	// В журнале
	ОперацииСБрокером = Новый Массив;
	ОперацииСБрокером.Добавить(Перечисления.ВидыОперацийБэкОфиса.Маржа);
	ОперацииСБрокером.Добавить(Перечисления.ВидыОперацийБэкОфиса.НачислениеЗадолженности);
	ОперацииСБрокером.Добавить(Перечисления.ВидыОперацийБэкОфиса.Оплата);
	ОперацииСБрокером.Добавить(Перечисления.ВидыОперацийБэкОфиса.Сделка);
	ОперацииСБрокером.Добавить(Перечисления.ВидыОперацийБэкОфиса.СделкаРЕПО);
	ОперацииСБрокером.Добавить(Перечисления.ВидыОперацийБэкОфиса.СделкаСВалютой);
	
	// По основанию:
	// ОтменаСделки
	// ИзменениеУсловийСделки
	// ИсполнениеОбязательствПоСделке
	
	// Для ПереводДенежныхСредств должно быть два подтверждения:
	// отчет брокера (брокер-получатель) и банковская выписка
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналОперацийБэкОфиса.Документ КАК Документ
		|ПОМЕСТИТЬ _ПереводыДенежныхСредствСБанком
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ПО (ПереводДенежныхСредств.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (&Брокер В (ПереводДенежныхСредств.Брокер, ПереводДенежныхСредств.БрокерПолучатель))
		|			И (ПереводДенежныхСредств.Брокер <> ПереводДенежныхСредств.БрокерПолучатель)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ПереводДенежныхСредств)
		|	И (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПереводДенежныхСредств.Ссылка КАК Ссылка,
		|	ПереводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ПереводыДенежныхСредствСПодтвержденнымиПоступлениямиНаСчетБанка
		|ИЗ
		|	Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПереводыДенежныхСредствСБанком КАК _ПереводыДенежныхСредствСБанком
		|		ПО ПереводДенежныхСредств.Ссылка = _ПереводыДенежныхСредствСБанком.Документ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ПО (РеестрПлатежей.Регистратор = ПереводДенежныхСредств.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПереводДенежныхСредств.Ссылка,
		|	ПереводДенежныхСредств.СчетДоверительногоУправления
		|
		|ИМЕЮЩИЕ
		|	(ПереводДенежныхСредств.Брокер <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|		ИЛИ ПереводДенежныхСредств.Сумма = СУММА(ВЫБОР
		|				КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					ТОГДА РеестрПлатежей.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ)) И
		|	(ПереводДенежныхСредств.БрокерПолучатель <> ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|		ИЛИ ПереводДенежныхСредств.Сумма = СУММА(ВЫБОР
		|				КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					ТОГДА РеестрПлатежей.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналОперацийБэкОфиса.Документ КАК Операция,
		|	ЖурналОперацийБэкОфиса.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	"""" КАК Примечание
		|ПОМЕСТИТЬ _ОперацииБрокера
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации В(&ОперацииСБрокером)
		|	И (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И ЖурналОперацийБэкОфиса.Брокер = &Брокер
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Сделка.Ссылка,
		|	Сделка.СчетДоверительногоУправления,
		|	""""
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	Сделка.Организация = &Организация
		|	И (Сделка.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И Сделка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Сделка.Проведен = ИСТИНА
		|	И Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И Сделка.Брокер = &Брокер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИсполнениеОбязательствПоСделке.Ссылка,
		|	ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления,
		|	""""
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|ГДЕ
		|	ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И (ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И ИсполнениеОбязательствПоСделке.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ИсполнениеОбязательствПоСделке.Проведен = ИСТИНА
		|	И ИсполнениеОбязательствПоСделке.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И ИсполнениеОбязательствПоСделке.Основание.Брокер = &Брокер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	ЖурналОперацийБэкОфиса.СчетДоверительногоУправления,
		|	""""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтменаСделки КАК ОтменаСделки
		|		ПО (ОтменаСделки.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (ОтменаСделки.Сделка.Брокер = &Брокер)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ОтменаСделки)
		|	И (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	ЖурналОперацийБэкОфиса.СчетДоверительногоУправления,
		|	""""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ПО (ИзменениеУсловийСделки.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (ИзменениеУсловийСделки.Основание.Брокер = &Брокер)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ИзменениеУсловийСделки)
		|	И (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	ЖурналОперацийБэкОфиса.СчетДоверительногоУправления,
		|	""""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ПО (ИсполнениеОбязательствПоСделке.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (ИсполнениеОбязательствПоСделке.Основание.Брокер = &Брокер)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ИсполнениеОбязательствПоСделке)
		|	И (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	ЖурналОперацийБэкОфиса.СчетДоверительногоУправления,
		|	""""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ПО (ПереводДенежныхСредств.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (&Брокер В (ПереводДенежныхСредств.Брокер, ПереводДенежныхСредств.БрокерПолучатель))
		|			И (ПереводДенежныхСредств.Брокер = ПереводДенежныхСредств.БрокерПолучатель)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ПереводДенежныхСредств)
		|	И (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|			ИЛИ &СчетДоверительногоУправления = НЕОПРЕДЕЛЕНО)
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереводДенежныхСредств.Ссылка,
		|	ПереводДенежныхСредств.СчетДоверительногоУправления,
		|	""Поступление на счет банка подтверждено банковскими выписками""
		|ИЗ
		|	_ПереводыДенежныхСредствСПодтвержденнымиПоступлениямиНаСчетБанка КАК ПереводДенежныхСредств 
		|ГДЕ
		|	&ДляПодтвержденияОтчетомБрокера
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПереводДенежныхСредств.Ссылка,
		|	ПереводДенежныхСредств.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ПодтвержденыеПоступлениямиНаСчетБанка.Ссылка ЕСТЬ NULL 
		|			ТОГДА ""Поступление на счет банка не подтверждено банковскими выписками""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	Документ.ПереводДенежныхСредств КАК ПереводДенежныхСредств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПереводыДенежныхСредствСБанком КАК _ПереводыДенежныхСредствСБанком
		|		ПО ПереводДенежныхСредств.Ссылка = _ПереводыДенежныхСредствСБанком.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереводыДенежныхСредствСПодтвержденнымиПоступлениямиНаСчетБанка КАК ПодтвержденыеПоступлениямиНаСчетБанка
		|		ПО ПодтвержденыеПоступлениямиНаСчетБанка.Ссылка = ПереводДенежныхСредств.Ссылка
		|ГДЕ
		|	НЕ &ДляПодтвержденияОтчетомБрокера
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Организация КАК Организация,
		|	_ОперацииБрокера.Операция КАК Операция,
		|	_ОперацииБрокера.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(_ОперацииБрокера.Операция) КАК ПредставлениеОперации,
		|	_ОперацииБрокера.Примечание КАК Примечание
		|ИЗ
		|	_ОперацииБрокера КАК _ОперацииБрокера
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(
		|				,
		|				(Операция, Организация) В
		|					(ВЫБРАТЬ
		|						_ОперацииБрокера.Операция,
		|						&Организация
		|					ИЗ
		|						_ОперацииБрокера)) КАК ПодтверждениеОперацийБэкОфиса
		|		ПО (ПодтверждениеОперацийБэкОфиса.Организация = &Организация)
		|			И (ПодтверждениеОперацийБэкОфиса.Операция = _ОперацииБрокера.Операция)
		|			И (ПодтверждениеОперацийБэкОфиса.Подтверждена = ИСТИНА)
		|ГДЕ
		|	ПодтверждениеОперацийБэкОфиса.Организация ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Брокер",							Брокер);
	Запрос.УстановитьПараметр("НачалоПериода",					НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",					КонецПериода);
	Запрос.УстановитьПараметр("ОперацииСБрокером",				ОперацииСБрокером);
	Запрос.УстановитьПараметр("ДляПодтвержденияОтчетомБрокера",	ДляПодтвержденияОтчетомБрокера);

	НеподтвержденныеОперации = Запрос.Выполнить().Выгрузить();
	
	Возврат НеподтвержденныеОперации;	
	
КонецФункции

#КонецОбласти

#Область Операции_с_депозитарием

Функция ПодтвердитьОперацииСДепозитарием(Организация, СчетДоверительногоУправления, ДепозитарнаяКомпания, Знач НачалоПериода, Знач КонецПериода) Экспорт
	
	Если ТипЗнч(ДепозитарнаяКомпания) <> Тип("СправочникСсылка.ДепозитарныеКомпании") ИЛИ Не ЗначениеЗаполнено(ДепозитарнаяКомпания) Тогда
		ВызватьИсключение "Передано некорректное значение параметра 'ДепозитарнаяКомпания'";	
	КонецЕсли;
	
	// Подтверждаем операции только после 01.10.2017	
	НачалоПериода	= Макс('20171001', НачалоПериода);
	КонецПериода	= Макс('20171001', КонецПериода);
	
	// В журнале по свойствам ДепозитарныйСчет.Депозитарий:	
	ОперацииСДепозитарием = Новый Массив;
	ОперацииСДепозитарием.Добавить(Перечисления.ВидыОперацийБэкОфиса.ВводЦенныхБумаг);
	ОперацииСДепозитарием.Добавить(Перечисления.ВидыОперацийБэкОфиса.ВыводЦенныхБумаг);
	ОперацииСДепозитарием.Добавить(Перечисления.ВидыОперацийБэкОфиса.СнятиеЦеннойБумагиСУчета);
	ОперацииСДепозитарием.Добавить(Перечисления.ВидыОперацийБэкОфиса.СписаниеЦеннойБумаги);
	
	// Для следующих документов ищем по свойствам:
	// - КонвертацияЦенныхБумаг: ЦенныеБумаги.ДепозитарныйСчет.Депозитарий
	// - ПоставкаЦенныхБумаг: когда Депозитарий и ЦенныеБумаги.ДепозитарныйСчет.Депозитарий являются проверяемым депозитарием 
	// - ПереводЦенныхБумаг: когда оба счета проверяемого депозитария, либо по второму депозитарию ранее выполнена сверка
	
	// Заполним соответствие депозитарных компаний и их отчетов			
	ДепозитарныеКомпанииИОтчеты = Новый ТаблицаЗначений;
	ДепозитарныеКомпанииИОтчеты.Колонки.Добавить("ДепозитарнаяКомпания", Новый ОписаниеТипов("СправочникСсылка.ДепозитарныеКомпании"));
	ДепозитарныеКомпанииИОтчеты.Колонки.Добавить("ОтчетДепозитария", Новый ОписаниеТипов("СправочникСсылка.ВнешниеСистемы"));
	
	ЗаполнитьЗначенияСвойств(ДепозитарныеКомпанииИОтчеты.Добавить(), Новый Структура("ДепозитарнаяКомпания, ОтчетДепозитария", ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_БК_Регион"), Справочники.ВнешниеСистемы.ОтчетДепозитарияБКРегион));
	ЗаполнитьЗначенияСвойств(ДепозитарныеКомпанииИОтчеты.Добавить(), Новый Структура("ДепозитарнаяКомпания, ОтчетДепозитария", ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_ДК_Регион"), Справочники.ВнешниеСистемы.ОтчетДепозитарияДКРегион));
	ЗаполнитьЗначенияСвойств(ДепозитарныеКомпанииИОтчеты.Добавить(), Новый Структура("ДепозитарнаяКомпания, ОтчетДепозитария", ОбщегоНазначения.ПолучитьИменованныйОбъект("СпецДепозитарий_ВТБ"), Справочники.ВнешниеСистемы.ОтчетДепозитарияВТБ));
	ЗаполнитьЗначенияСвойств(ДепозитарныеКомпанииИОтчеты.Добавить(), Новый Структура("ДепозитарнаяКомпания, ОтчетДепозитария", ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_Инфинитум"), Справочники.ВнешниеСистемы.ОтчетДепозитарияИнфинитум));
	ЗаполнитьЗначенияСвойств(ДепозитарныеКомпанииИОтчеты.Добавить(), Новый Структура("ДепозитарнаяКомпания, ОтчетДепозитария", ОбщегоНазначения.ПолучитьИменованныйОбъект("СпецДепозитарий_Сбербанка"), Справочники.ВнешниеСистемы.ОтчетДепозитарияСбербанка));
	ЗаполнитьЗначенияСвойств(ДепозитарныеКомпанииИОтчеты.Добавить(), Новый Структура("ДепозитарнаяКомпания, ОтчетДепозитария", ОбщегоНазначения.ПолучитьИменованныйОбъект("Регистратор_НРК"), Справочники.ВнешниеСистемы.ОтчетРегистратораНРК));	
	
	// Ищем подходящие операции		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДепозитарныеКомпанииИОтчеты.ДепозитарнаяКомпания КАК ДепозитарнаяКомпания,
		|	ДепозитарныеКомпанииИОтчеты.ОтчетДепозитария КАК ОтчетДепозитария
		|ПОМЕСТИТЬ _ДепозитарныеКомпанииИОтчеты
		|ИЗ
		|	&ДепозитарныеКомпанииИОтчеты КАК ДепозитарныеКомпанииИОтчеты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЖурналОперацийБэкОфиса.Документ КАК Документ
		|ПОМЕСТИТЬ _ПоставкиЦенныхБумагОтДругогоДепозитария
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
		|		ПО (ПоставкаЦенныхБумаг.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг.ЦенныеБумаги КАК ПоставкаЦенныхБумагЦенныеБумаги
		|		ПО (ПоставкаЦенныхБумагЦенныеБумаги.Ссылка = ПоставкаЦенныхБумаг.Ссылка)
		|			И (ПоставкаЦенныхБумагЦенныеБумаги.ДепозитарныйСчет.Депозитарий <> &ДепозитарнаяКомпания)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ПоставкаЦенныхБумаг)
		|	И ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЖурналОперацийБэкОфиса.Документ КАК Документ
		|ПОМЕСТИТЬ _КонвертацияЦенныхБумагОтДругогоДепозитария
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонвертацияЦенныхБумаг.ЦенныеБумаги КАК КонвертацияЦенныхБумагЦенныеБумаги
		|		ПО (КонвертацияЦенныхБумагЦенныеБумаги.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (КонвертацияЦенныхБумагЦенныеБумаги.ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонвертацияЦенныхБумаг.ЦенныеБумаги КАК КонвертацияЦенныхБумагЦенныеБумагиОтДругогоДепозитария
		|		ПО (КонвертацияЦенныхБумагЦенныеБумагиОтДругогоДепозитария.Ссылка = КонвертацияЦенныхБумагЦенныеБумаги.Ссылка)
		|			И (КонвертацияЦенныхБумагЦенныеБумагиОтДругогоДепозитария.ДепозитарныйСчет.Депозитарий <> &ДепозитарнаяКомпания)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.КонвертацияЦенныхБумаг)
		|	И ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналОперацийБэкОфиса.Документ КАК Операция,
		|	"""" КАК Примечание
		|ПОМЕСТИТЬ _ОперацииДепозитария
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации В(&ОперацииСДепозитарием)
		|	И ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|	И ВЫБОР
		|			КОГДА ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.ВводЦенныхБумаг
		|				ТОГДА ВЫРАЗИТЬ(ЖурналОперацийБэкОфиса.Документ КАК Документ.ВводЦенныхБумаг).ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания
		|			КОГДА ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.ВыводЦенныхБумаг
		|				ТОГДА ВЫРАЗИТЬ(ЖурналОперацийБэкОфиса.Документ КАК Документ.ВыводЦенныхБумаг).ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания
		|			КОГДА ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.СнятиеЦеннойБумагиСУчета
		|				ТОГДА ВЫРАЗИТЬ(ЖурналОперацийБэкОфиса.Документ КАК Документ.СнятиеЦеннойБумагиСУчета).ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания
		|			КОГДА ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.СписаниеЦеннойБумаги
		|				ТОГДА ВЫРАЗИТЬ(ЖурналОперацийБэкОфиса.Документ КАК Документ.СписаниеЦеннойБумаги).ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	""""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
		|		ПО (ПоставкаЦенныхБумаг.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг.ЦенныеБумаги КАК ПоставкаЦенныхБумагЦенныеБумаги
		|		ПО (ПоставкаЦенныхБумагЦенныеБумаги.Ссылка = ПоставкаЦенныхБумаг.Ссылка)
		|			И (ПоставкаЦенныхБумагЦенныеБумаги.ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПоставкиЦенныхБумагОтДругогоДепозитария КАК _ПоставкиЦенныхБумагОтДругогоДепозитария
		|		ПО (_ПоставкиЦенныхБумагОтДругогоДепозитария.Документ = ЖурналОперацийБэкОфиса.Документ)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ПоставкаЦенныхБумаг)
		|	И ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|	И _ПоставкиЦенныхБумагОтДругогоДепозитария.Документ ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	""""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонвертацияЦенныхБумаг.ЦенныеБумаги КАК КонвертацияЦенныхБумагЦенныеБумаги
		|		ПО (КонвертацияЦенныхБумагЦенныеБумаги.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (КонвертацияЦенныхБумагЦенныеБумаги.ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КонвертацияЦенныхБумагОтДругогоДепозитария КАК _КонвертацияЦенныхБумагОтДругогоДепозитария
		|		ПО (_КонвертацияЦенныхБумагОтДругогоДепозитария.Документ = ЖурналОперацийБэкОфиса.Документ)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.КонвертацияЦенныхБумаг)
		|	И ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|	И _КонвертацияЦенныхБумагОтДругогоДепозитария.Документ ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	""""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереводЦенныхБумаг КАК ПереводЦенныхБумаг
		|		ПО (ПереводЦенныхБумаг.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания)
		|			И (ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Депозитарий = &ДепозитарнаяКомпания)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ПереводЦенныхБумаг)
		|	И ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Документ,
		|	""На основе сверок с отчетами обоих депозитариев""
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереводЦенныхБумаг КАК ПереводЦенныхБумаг
		|		ПО (ПереводЦенныхБумаг.Ссылка = ЖурналОперацийБэкОфиса.Документ)
		|			И (&ДепозитарнаяКомпания В (ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий, ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Депозитарий))
		|			И (ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий <> ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Депозитарий)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДепозитарныеКомпанииИОтчеты КАК _ДепозитарныеКомпанииИОтчеты
		|		ПО (_ДепозитарныеКомпанииИОтчеты.ДепозитарнаяКомпания = ВЫБОР
		|				КОГДА ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий = &ДепозитарнаяКомпания
		|					ТОГДА ПереводЦенныхБумаг.ДепозитарныйСчетПолучатель.Депозитарий
		|				ИНАЧЕ ПереводЦенныхБумаг.ДепозитарныйСчет.Депозитарий
		|			КОНЕЦ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналСверокПоВнутреннемуУчету.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЖурналСверокПоВнутреннемуУчету
		|		ПО (ЖурналСверокПоВнутреннемуУчету.ПериодСверки = НАЧАЛОПЕРИОДА(ПереводЦенныхБумаг.Дата, ДЕНЬ))
		|			И (ЖурналСверокПоВнутреннемуУчету.Основание = _ДепозитарныеКомпанииИОтчеты.ОтчетДепозитария)
		|			И (ЖурналСверокПоВнутреннемуУчету.Пройдена = ИСТИНА)
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЖурналОперацийБэкОфиса.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ПереводЦенныхБумаг)
		|	И ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ДатаПодтверждения КАК Период,
		|	&Организация КАК Организация,
		|	_ОперацииДепозитария.Операция КАК Операция,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(_ОперацииДепозитария.Операция) КАК ПредставлениеОперации,
		|	ИСТИНА КАК Подтверждена,
		|	""Отчет депозитария"" КАК Основание,
		|	ЛОЖЬ КАК РучнойРежим,
		|	_ОперацииДепозитария.Примечание КАК Примечание,
		|	&СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	_ОперацииДепозитария КАК _ОперацииДепозитария
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(
		|				,
		|				(Операция, Организация) В
		|					(ВЫБРАТЬ
		|						_ОперацииДепозитария.Операция,
		|						&Организация
		|					ИЗ
		|						_ОперацииДепозитария)) КАК ПодтверждениеОперацийБэкОфиса
		|		ПО (ПодтверждениеОперацийБэкОфиса.Организация = &Организация)
		|			И (ПодтверждениеОперацийБэкОфиса.Операция = _ОперацииДепозитария.Операция)
		|			И (ПодтверждениеОперацийБэкОфиса.Подтверждена = ИСТИНА)
		|ГДЕ
		|	ПодтверждениеОперацийБэкОфиса.Организация ЕСТЬ NULL");
		
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДепозитарнаяКомпания",			ДепозитарнаяКомпания);
	Запрос.УстановитьПараметр("НачалоПериода",					НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",					КонецПериода);
	Запрос.УстановитьПараметр("ОперацииСДепозитарием",			ОперацииСДепозитарием);
	Запрос.УстановитьПараметр("ДепозитарныеКомпанииИОтчеты",	ДепозитарныеКомпанииИОтчеты);	
	Запрос.УстановитьПараметр("ДатаПодтверждения",				ТекущаяДата());
	
	УстановитьПривилегированныйРежим(Истина);	
	
	НеподтвержденныеОперации = Запрос.Выполнить().Выгрузить();		
	
	ПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьНаборЗаписей();
	ПодтверждениеОперацийБэкОфиса.Отбор.Организация.Установить(Организация);
	ПодтверждениеОперацийБэкОфиса.Загрузить(НеподтвержденныеОперации);
	ПодтверждениеОперацийБэкОфиса.Записать(Ложь);	
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	Возврат НеподтвержденныеОперации;
КонецФункции

#КонецОбласти

#КонецОбласти

Функция ПолучитьРезультатыСверкиСЖурналомПодтверждений(ДатаНачала, ДатаОкончания, Организация, ОтборКлиентов = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаНачала) ИЛИ Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для получения результатов сверки должны быть заданы границы периода");
		Возврат Неопределено;
	КонецЕсли;	
	        
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Организация КАК Организация,
		|	Сделка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Сделка.Ссылка КАК Операция,
		|	НАЧАЛОПЕРИОДА(Сделка.Дата, ДЕНЬ) КАК ДатаОперации
		|ПОМЕСТИТЬ _ОперацииКлиента
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|ГДЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.Сделка) В (&ПодтверждаемыеВидыОпераций)
		|	И Сделка.Организация = &Организация
		|	И Сделка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И Сделка.Проведен = ИСТИНА
		|	И &СчетДоверительногоУправления В (Сделка.СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИсполнениеОбязательствПоСделке.Организация,
		|	ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления,
		|	ИсполнениеОбязательствПоСделке.Ссылка,
		|	НАЧАЛОПЕРИОДА(ИсполнениеОбязательствПоСделке.Дата, ДЕНЬ)
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|ГДЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ИсполнениеОбязательствПоСделке) В (&ПодтверждаемыеВидыОпераций)
		|	И ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И ИсполнениеОбязательствПоСделке.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ИсполнениеОбязательствПоСделке.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И ИсполнениеОбязательствПоСделке.Проведен = ИСТИНА
		|	И &СчетДоверительногоУправления В (ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Организация,
		|	ЖурналОперацийБэкОфиса.СчетДоверительногоУправления,
		|	ЖурналОперацийБэкОфиса.Документ,
		|	НАЧАЛОПЕРИОДА(ЖурналОперацийБэкОфиса.Дата, ДЕНЬ)
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.ВидОперации В(&ПодтверждаемыеВидыОпераций)
		|	И НЕ(ЖурналОперацийБэкОфиса.Документ ССЫЛКА Документ.ПоручениеНаДвижениеДенежныхСредств
		|				И ВЫРАЗИТЬ(ЖурналОперацийБэкОфиса.Документ КАК Документ.ПоручениеНаДвижениеДенежныхСредств).СпособПередачи = ЗНАЧЕНИЕ(Перечисление.СпособыПередачиПоручений.ВнутренняяСистема))
		|	И ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И ЖурналОперацийБэкОфиса.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|	И &СчетДоверительногоУправления В (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ОперацииКлиента.Организация КАК Организация,
		|	_ОперацииКлиента.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ОперацииКлиента.ДатаОперации КАК ДатаОперации,
		|	ЕСТЬNULL(ПодтверждениеОперацийБэкОфиса.Подтверждена, ЛОЖЬ) КАК ОперацияПодтверждена
		|ПОМЕСТИТЬ _ПроверенныеКлиенты
		|ИЗ
		|	_ОперацииКлиента КАК _ОперацииКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(
		|				,
		|				(Организация, Операция) В
		|					(ВЫБРАТЬ
		|						_ОперацииКлиента.Организация,
		|						_ОперацииКлиента.Операция
		|					ИЗ
		|						_ОперацииКлиента)) КАК ПодтверждениеОперацийБэкОфиса
		|		ПО (ПодтверждениеОперацийБэкОфиса.Организация = _ОперацииКлиента.Организация)
		|			И (ПодтверждениеОперацийБэкОфиса.Операция = _ОперацииКлиента.Операция)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _ДниСверок
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления.Организация КАК Организация,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВложенныйЗапрос.Дата КАК ПериодСверки
		|ПОМЕСТИТЬ _ДниСверокКлиентов
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДниСверок.Дата КАК Дата,
		|		СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|		ЛицензииДоговоровДоверительногоУправления.Лицензия КАК Лицензия,
		|		МАКСИМУМ(ЛицензииДоговоровДоверительногоУправления.Период) КАК ПериодЛицензии
		|	ИЗ
		|		_ДниСверок КАК _ДниСверок
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|			ПО (СчетаДоверительногоУправления.Организация = &Организация)
		|				И (НЕ СчетаДоверительногоУправления.ПометкаУдаления)
		|				И (СчетаДоверительногоУправления.ДатаЗаключения <= _ДниСверок.Дата)
		|				И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= _ДниСверок.Дата)
		|				И (&СчетДоверительногоУправления В (СчетаДоверительногоУправления.Ссылка, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка)))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|			ПО (ЛицензииДоговоровДоверительногоУправления.Организация = &Организация)
		|				И (СчетаДоверительногоУправления.Ссылка = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления)
		|				И _ДниСверок.Дата >= ЛицензииДоговоровДоверительногоУправления.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДниСверок.Дата,
		|		СчетаДоверительногоУправления.Ссылка,
		|		ЛицензииДоговоровДоверительногоУправления.Лицензия) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
		|		ПО ВложенныйЗапрос.ПериодЛицензии = ЛицензииДоговоровДоверительногоУправления.Период
		|			И (ЛицензииДоговоровДоверительногоУправления.Организация = &Организация)
		|			И ВложенныйЗапрос.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Лицензия = ЛицензииДоговоровДоверительногоУправления.Лицензия
		|			И (ЛицензииДоговоровДоверительногоУправления.Действует)
		|ГДЕ
		|	&ВидДеятельности В (ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности, ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниСверокКлиентов.Организация КАК Организация,
		|	_ДниСверокКлиентов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДниСверокКлиентов.ПериодСверки КАК ПериодСверки,
		|	МИНИМУМ(ЕСТЬNULL(_ПроверенныеКлиенты.ОперацияПодтверждена, ИСТИНА)) КАК Пройдена
		|ИЗ
		|	_ДниСверокКлиентов КАК _ДниСверокКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПроверенныеКлиенты КАК _ПроверенныеКлиенты
		|		ПО (_ПроверенныеКлиенты.Организация = _ДниСверокКлиентов.Организация)
		|			И (_ПроверенныеКлиенты.СчетДоверительногоУправления = _ДниСверокКлиентов.СчетДоверительногоУправления)
		|			И (_ПроверенныеКлиенты.ДатаОперации = _ДниСверокКлиентов.ПериодСверки)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДниСверокКлиентов.Организация,
		|	_ДниСверокКлиентов.СчетДоверительногоУправления,
		|	_ДниСверокКлиентов.ПериодСверки");
	
	СчетДоверительногоУправления	= Справочники.СчетаДоверительногоУправления.ПустаяСсылка();
	ВидДеятельности					= Справочники.ВидыДеятельности.ПустаяСсылка();
	
	Если ТипЗнч(ОтборКлиентов) = Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
		СчетДоверительногоУправления = ОтборКлиентов;
	ИначеЕсли ТипЗнч(ОтборКлиентов) = Тип("СправочникСсылка.ВидыДеятельности") Тогда
		ВидДеятельности = ОтборКлиентов;
	ИначеЕсли ОтборКлиентов <> Неопределено Тогда
		ВызватьИсключение "Неизвестный тип отбора клиентов """ + Строка(ОтборКлиентов) + """";
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("ДатаНачала",						ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",					ДатаОкончания);
	Запрос.УстановитьПараметр("ПодтверждаемыеВидыОпераций",		ПолучитьПодтверждаемыеВидыОпераций());
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидДеятельности",				ВидДеятельности);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
